quiz_2020 = {}
quiz_2020['topics'] = {'var':'Переменные. Типы данных. Вывод на экран.',
        'cond':'Условные операторы',
        'cycle':'Циклы',
        'list':'Списки. Словари',          
        'build':'Встроенные функции',          
        'func':'Функции',
        'file':'Файлы'
        }

quiz_2021 = {}
quiz_2021['topics'] = {'var':'Переменные. Типы данных. Вывод на экран.',
        'cond':'Условные операторы',
        'turtle':'Turtle'
        }

quizzes = {}
quizzes['2020'] = quiz_2020
quizzes['2021'] = quiz_2021